'use strict';
// Задание №1
/* Дана переменная sum (сумма покупки).
В зависимости от значения переменной sum рассчитать персональную скидку и  вывести в консоль сумму к оплате с учетом скидки!:
сумма до 1000 - скидка не предусмотрена
сумма от 1000 до 2000 - скидка 5%
сумма от 2000 до 3000 - скидка 10%
сумма от 3000 - скидка 10% + подарок */
let sum = 900;
let result;

if (sum < 1000) {
    result = "Скидка не предусмотрена.";
} else if (sum >= 1000 && sum < 2000) {
    sum = sum - ((sum / 100) * 5);
    result = "Скидка 5%.";
} else if (sum >= 2000 && sum <= 3000) {
    sum = sum - ((sum / 100) * 10);
    result = "Скидка 10%.";
} else if (sum > 3000) {
    sum = sum - ((sum / 100) * 10);
    result = "Скидка 10% + подарок!";
}
console.log(`Ваша сумма: ${sum}. ${result}`);
// Вывессти сумму в скидке. Посчитать скидку с суммой.

console.log();
// Задание №2
/* Даны переменные: lang, salary
 Eсли значение lang - javascript перейти к проверке salary.
 Eсли значение salary > 100000, присвоить переменной result - Приглашаем Вас на собеседование.
 Eсли больше, присвоить переменной result - Мы перезвоним Вам в ближайшее время. */
let lang = 'javascript';
let salary = 100000;
if (lang === 'javascript') {
    if (salary > 100000) {
        result = "Приглашаем Вас на собеседование";
    }
    if (salary <= 100000) {
        result = "Мы перезвоним Вам в ближайшее время";
    }
} else {
    result = "Простите";
}
console.log(result);
console.log();

// Задание №3
/* Дана константа month (название месяца), в зависимости от названия месяца присвоить значение переменной season:
декабрь / январь / февраль  -> присвоить значение "зима"
март / апрель / май  -> присвоить значение "весна"
июнь / июль / август  -> присвоить значение "лето"
сентябрь / окрябрь / ноябрь  -> присвоить значение "осень" */

const YEAR_MONTH = "январь";
let season;
switch (YEAR_MONTH) {
    case "декабрь":
    case "январь":
    case "февраль":
        season = "зима";
        break;
    case "март":
    case "апрель":
    case "май":
        season = "весна";
        break;
    case "июнь":
    case "июль":
    case "август":
        season = "лето";
        break;
    case "сентябрь":
    case "октябрь":
    case "ноябрь":
        season = "осень";
        break;
    default:
        season = "какое время года?";
}
console.log(`Сейчас ${season}`);